In [60]:
import pandas as pd

In [61]:
india_weather = {
    'city': ['mumbai', 'delhi', 'baglore'],
    'temperature': [32, 45, 30],
    'humidity': [80, 60, 78]
}

In [62]:
india_weather = pd.DataFrame(india_weather)

In [63]:
us_weather = pd.DataFrame({
    'city': ['new york', 'chicago', 'orlando'],
    'temperature': [21, 14, 35],
    'humidity': [68, 65, 75]
})

In [64]:
india_weather

      city  humidity  temperature
0   mumbai        80           32
1    delhi        60           45
2  baglore        78           30

In [65]:
us_weather

       city  humidity  temperature
0  new york        68           21
1   chicago        65           14
2   orlando        75           35

In [66]:
df = pd.concat([india_weather, us_weather], ignore_index = True)
df

       city  humidity  temperature
0    mumbai        80           32
1     delhi        60           45
2   baglore        78           30
3  new york        68           21
4   chicago        65           14
5   orlando        75           35

In [67]:
df = df.loc[0:2, 'city']

In [69]:
type(df)

pandas.core.series.Series